{
  "occupation": "Computer Engineering Student",
  "more_about": "Hello, my name is Samuel Michael Vanié. Currently in the second year of Information Systems Engineering at the National School of Computer Science and Applied Mathematics of Grenoble (ENSIMAG), I am passionate about solving complex problems and creating innovative solutions. I love programming in all its aspects. Throughout my journey, I have explored various areas such as web backend and frontend programming in Javascript, Python, Java, and C#, as well as Rust (see my resume for the complete list of frameworks). I also do hybrid mobile development with Flutter and React Native, and native development with Java (yes, I haven't caught up with Kotlin yet). Above all, I love systems programming (I love challenges). Linux is my preferred OS, but I can also use Windows and MacOS.",
  "service": "I can work on all kinds of projects and adapt to most environments, as long as I meet friendly people and projects that represent a challenge. However, that's not all I do; I'm an athlete, I love volleyball, I play a lot of games, and I can sing. Have a good time on my site and feel free to contact me if you have any questions.",
  "download": "Feel free to download my resume",
  "download_cv": "Resume",
  "design_title": "Beautiful Designs",
  "design_description": "Creating beautiful and elegant designs tailored to your needs.",
  "design_tools_text": "The tools I use for design are",
  "optimization_title": "Clean and Optimized Code",
  "optimization_description": "Thanks to my courses and some experiences in systems, I have a mindset oriented towards code optimization and ease of maintenance.",
  "sysnet_title": "System Administration and Programming",
  "sysnet_description": "I have knowledge in system administration thanks to my 7 years of experience with Linux (I've tried at least every distro family, and I'm mainly on Arch). I also have basics in IP networking, creating local networks, and managing devices such as switches and routers.",
  "inspiring_proj_title": "Inspiring Projects",
  "inspiring_proj_description": "This is a non-exhaustive list of my projects; some of them are private because they belong to companies or schools.",
  "call_to_click_inspiring": "Click on the project image to learn more and close by clicking on the cross just above the popup that appears",
  "check_the_link": "Check the link",
  "chang_title": "Chang and Robert Algorithm",
  "chang_description": "Implementation of the Chang and Robert algorithm in GOLANG. This algorithm is used in distributed systems to elect a leader among connected hosts and thus aid in solving the mutual exclusion problem.",
  "cpp_datastruct_title": "Implementations of Data Structures and Algorithms in C++",
  "cpp_datastruct_description": "Contains implementations in C++ of popular data structures and algorithms but using only smart pointers instead of raw pointers. I am working gradually on this project.",
  "deliveroo_title": "Deliveroo Clone",
  "deliveroo_description": "This is a mobile application I created in React Native following a tutorial on YouTube. My personal touch involves payments using stripe. Check out the demo video on my github repo, the link is below.",
  "dojo_title": "Dojo Blog",
  "dojo_description": "This is a minimalist blog created using a Youtube tutorial to learn ReactJS and CSS. You can check the demo video on the link below.",
  "ray_tracing_title": "RayTracing",
  "ray_tracing_description": "Raytracing is an optical calculation method used for object rendering. It involves simulating the reverse path of light (light reaches our retina to produce the image, in this case, it's the opposite). You can understand the mathematical and physical calculation methods involved by reading the dedicated Wikipedia page.",
  "konesto_title": "KONESTO RESTAURANT WEBSITE",
  "konesto_description": "Web application created on a Raspberry Pi in HTML, Bootstrap, and PHP and Javascript. It allows the user to view the restaurant menu but also to order and make payments by card containing an RFID chip. You can check the site, but most operations are not possible as it is private, and this demo is not connected to any Raspberry. However, the source code remains available via the link below.",
  "laptop_title": "LAPTOP UI",
  "laptop_description": "Simple hero section for a computer sales page created in HTML and CSS. Check it out via the link below.",
  "plateformeesi_title": "PLATEFORMEESI",
  "plateformeesi_description": "Web application created for grade management, report editing, and student attendance management. The official site is private at the National Polytechnic Institute Houphouet-Boigny in Yamoussoukro, so you can only view the results from the report my team and I produced by clicking the link below.",
  "portfolio_title": "PORTFOLIO",
  "portfolio_description": "Let's talk about the page we're on now. This is my portfolio, a showcase of some of my projects (it's hard to keep it up to date while working on others, I even have to reorganize it to facilitate certain tasks). I created this page using the NextJS (ReactJs evolved) and TailwindCSS frameworks. Check out the source code if you're interested.",
  "pygame_title": "Python Game",
  "pygame_description": "First steps into the world of video games, I wanted to create a game using Pygame. I was able to create a version with my character moving and jumping in the environment, nothing more. You can check out the repo from the link below.",
  "gl_title": "Compiler for Deca Language",
  "gl_description": "Compiler for a programming language inspired by JAVA created in a team as part of the GL project at the National School of Computer Science and Applied Mathematics of Grenoble. This compiler translates to the assembly language of the 6510, the processor of the world's best-selling machine: the COMMODORE 64, and a processor inspired by Intel created at ENSIMAG. During this project, I was involved in all stages (lexer, parser, contextual checks, and transformation to target languages). This project, subject to the school's confidentiality rules, cannot be made public. However, the image (used thumbnail) represents a preview of the homemade ENSIMAG assembly language.",
  "blobwar_ai_title": "BLOBWAR AI",
  "blobwar_ai_description": "Use of the Minimax algorithm, very popular in game theory (in mathematics) for creating an artificial intelligence with multiple difficulty levels that can play the famous game called Blobwar. The project was completely implemented in Rust as part of the advanced algorithmics course at ENSIMAG.",
  "dailygen_title": "Daily Inspiration Message Generator",
  "dailygen_description": "Created using NextJS, Styled Components, and Typescript, this project has allowed and continues to help me discover AWS and the various services offered. I have been able to explore AWS Lambda so far and the use of the AWS console and its API. The project is still evolving; the version on github-pages will soon be replaced by an AWS link.",
  "snake_js_title": "Snake Game Grid",
  "snake_js_description": "Creation of the famous Snake game using Canvas API in javascript. The challenge of this project was using grids (CSS GRID) exclusively for setting up the game.",
  "youdotcom_title": "Youdotcom for Emacs",
  "youdotcom_description": "Youdotcom is a mode (package) I created for Emacs. It allows web searches from the editor using the You.com search engine. It is written in Emacs Lisp and uses artificial intelligence for more reliable searches. I recently submitted it to MELPA, and it was accepted by the developers who maintain it. I'm looking forward to seeing it on the official repository. I am officially part of the Emacs developer community. You can check the repo on the link below."
}
