{
    "occupation": "Etudiant en ingénierie informatique",
    "more_about": "J'aime la programmation sous tous ses aspects. Je suis à fond actuellement sur le développement en Rust. Cependant je fais de la programmation web backend et frontend en Javascript, Python, Java et C# en plus de Rust (voir mon CV pour les frameworks). Je fais également du développement mobile hybride avec Flutter et React Native et natif avec Java (et oui je ne me suis pas encore mis à jour sur Kotlin). Ce que j'adore par dessus tout c'est la programmation système (j'aime les challenges). Linux est mon système de prédilection, mais je sais utiliser Windows et MacOS.",
    "service": "Je peux travailler sur toutes sortes de projets et m'adapter à la plupart des environments tant que je rencontre des personnes sympathiques et des projets qui représentent un challenge. Attention, je ne fais pas que cela, je suis un sportif, j'adore le volleyball, je joue beaucoup aux jeux, je sais chanter.",
    "download": "N'hésitez pas à télécharger mon CV",
    "design_title": "De Beaux Designs",
    "design_description": "Créer de beaux et élégants designs adaptés à vos besoins",
    "design_tools_text": "Les outils que j'utilise pour le design sont",
    "optimization_title": "Code clean et optimisé",
    "optimization_description": "Grâce à mes cours et mes quelques expériences en système, j'ai un esprit orienté vers l'optimisation de code et la facilité de maintenance",
    "sysnet_title": "Administration et Programmation Système",
    "sysnet_description": "J'ai des connaissances en administration système grâçe à mes 7 ans d'expérience sous linux (j'ai essayé au moins chaque famille de distro, et je suis principalement sur Arch). J'ai également des bases en réseau IP, la création de réseaux locaux et la gestion de périphériques tels que les switchs et les routeurs.",
    "inspiring_proj_title": "Projets Inspirants",
    "inspiring_proj_description": "Ceci est une liste non exhaustive de mes projets, certains d'entre-eux sont privés parce qu'ils appartiennent à des entreprises.",
    "call_to_click_inspiring": "Cliquez sur l'image du projet pour en apprendre plus et fermez en cliquant sur la croix juste au dessus du popup qui apparaît",
    "check_the_link": "Consulter le lien",
    "chang_title": "Algorithme de Chang et Robert",
    "chang_description": "Implémentation de l'algorithme de Chang et Robert en GOLANG. Il s'agit d'un algorithme utilisé en systèmes distribués qui permet d'élire un leader parmis les hôtes connectés et ainsi aider dans la résolution du problème d'exclusion mutuelle.",
    "cpp_datastruct_title": "Implémentations de Structures de Données et d'Algorithmes en C++",
    "cpp_datastruct_description": "Contient des implémentations en C++ de structures de données et d'algorithmes populaires mais en utilisant uniquement des pointeurs intelligents (smart pointers) au lieu de pointeurs classiques (raw pointers). Je travaille progressivement sur ce projet",
    "deliveroo_title": "Deliveroo Clone",
    "deliveroo_description": "Il s'agit là d'une application mobile que j'ai crée en React Native en suivant un tutoriel sur Youtube. Ma touche personnelle concerne les paiements à l'aide de stripe. Consultez la vidéo de démo sur mon dépôt github, le lien se trouve ci-dessous.",
    "dojo_title": "Dojo Blog",
    "dojo_description": "Il s'agit d'un blog minimaliste crée à l'aide d'un tutoriel Youtube dans le but d'apprendre ReactJS et CSS. Vous pouvez consulter la vidéo de démo sur le lien ci-dessous.",
    "ray_tracing_title": "RayTracing",
    "ray_tracing_description": "Le raytracing est une méthode de calcul d'optique utilisée pour faire le rendu d'objet. Il consiste à simuler le parcours inverse de la lumière (la lumière parvient sur notre retine pour produire l'image, dans ce cas c'est l'inverse). Vous pouvez comprendre les méthodes de calculs mathématiques et physique qui sont impliqués en lisant la page wikipédia dédiée",
    "konesto_title": "KONESTO RESTAURANT SITE WEB",
    "konesto_description": "Application web crée sur un raspberry pi en HTML, Bootstrap et PHP et Javascript. Elle permet à l'utilisateur de consulter le menu du restaurant, mais également de commander et faire les paiements par carte contenant une puce RFID. Vous pouvez consulter le site mais la plupart des opérations ne sont pas possibles car il est privé et cette démo n'est connecté à aucun raspberry. Cependant le code source reste disponible via le lien ci-dessous",
    "laptop_title": "LAPTOP UI",
    "laptop_description": "Simple section hero pour une page de vente d'ordinateur créer en HTML et CSS. Consulter via le lien ci-dessous",
    "plateformeesi_title": "PLATEFORMEESI",
    "plateformeesi_description": "Application web crée pour la gestion des moyennes, l'édition des bulletins et la gestion des absences des étudiants. Le site officiel est privé à l'INSTITUT NATIONAL POLYTECHNIQUE HOUPHOUET-BOIGNY de Yamoussoukro, ainsi vous ne pouvez consulter les résultats qu'à partir du rapport que mon équipe et moi avons produit, en cliquant sur le lien ci-dessous",
    "portfolio_title": "PORTFOLIO",
    "portfolio_description": "Parlons maintenant de la page où nous sommes. Il s'agit de mon portfolio, un showcase de quelques-uns de mes projets (difficile de le maintenir à jour tout en travaillant sur d'autres, je dois même le réorganiser pour faciliter certaines tâches). J'ai crée cette page à l'aide des frameworks NextJS (ReactJs evolved) et TailwindCSS. Consultez le code source si cela vous intéresse",
    "pygame_title": "Python Game",
    "pygame_description": "Premier pas dans le monde du jeu vidéo, je souhaitais créer un jeu à l'aide de Pygame, j'ai pu créer une version avec mon personnage qui se déplace et saute dans l'environnement rien de plus. Vous pouvez consulter le dépôt à partir du lien ci-dessous.",
    "gl_title": "Compilateur pour Langage Deca",
    "gl_description": "Compilateur pour un langage de programmation inspiré de JAVA créé en équipe dans le cadre du projet GL à l'Ecole Nationale Supérieure d'Informatique et de Mathématiques Appliquées de Grenoble. Ce compilateur se charge de faire la traduction vers le langage d'assembleur du 6510, processeur de la célèbre machine la plus vendue au monde: le COMMODORE 64 et d'un processeur inspiré des Intel créé à l'ENSIMAG. Pendant ce projet je me suis retrouvé à toutes les étapes (le Lexeur, le parseur, les vérifications contextuelles ainsi que la transformation vers les langages cibles. Ce projet étant soumis aux règles de confidentialité de l'école, ne peut être rendu public. Cependant l'image (thumbnail utilisé) represente un aperçu du langage d'assembleur fait maison ENSIMAG",
    "blobwar_ai_title": "BLOBWAR AI",
    "blobwar_ai_description": "Utilisation de l'algorithme Minimax, très populaire en théorie des jeux (en mathématiques) pour la création d'une intelligence artificielle à plusieurs niveaux de difficulté pouvant jouer automatiquement au célèbre jeu appelé Blobwar. Le projet a complètement été mis en place en Rust dans le cadre du cours d'algorithmique avancée à l'ENSIMAG.",
    "dailygen_title": "Generateur de messages d'inspiration quotidien",
    "dailygen_description": "Créé à l'aide NextJS, Styled Components et Typescript, ce projet m'a permis et continue de m'aider à découvrir AWS et les différents services qui y sont offerts. J'ai pu découvrir AWS Lambda jusque là et l'utilisation de la console AWS et de son API. Le projet est encore en évolution, la version qui se trouve sur github-pages sera bientôt remplacé par un lien aws.",
    "snake_js_title": "Snake Game Grid",
    "snake_js_description": "Création d'un célèbre jeu Snake à l'aide de Canvas API en javascript. Le défi de ce projet etait l'utilisation des grilles (CSS GRID) uniquement pour la mise en place du jeu.",
    "youdotcom_title": "Youdotcom pour Emacs",
    "youdotcom_description": "Youdotcom est un mode (package) que j'ai crée pour Emacs. Il permet de faire des recherches sur le web à partir de l'éditeur. Il est écrit en Emacs Lisp et utilise l'intelligence articielle pour effectuer une recherche plus fiable sur le moteur de recherche de You. Je l'ai récemment soumis à MELPA et j'ai hâte de le voir sur le dépôt officiel. Je ferai officiellement partie ainsi de la communauté des développeurs Emacs. Vous pouvez consulter le dépôt sur le lien ci-dessous."

}
